Autodesk.Revit.DB.Events.ProgressChangedEventArgs.Cancel
Requests to cancel the progress bar's operation.
Remarks:
Note that an operation may only be cancelled if its stage is
'Unchanged' or if its stage is 'PositionChanged' and the 'Cancellable' property is 'true.'
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The operation cannot be cancelled.
Since:
2013

Autodesk.Revit.DB.Events.ProgressChangedEventArgs.Caption
The text from the progress bar caption that describes the operation in progress
Since:
2013

Autodesk.Revit.DB.Events.ProgressChangedEventArgs.UpperRange
Upper part of progress bar range - will be any non-zero number
Since:
2013

Autodesk.Revit.DB.Events.ProgressChangedEventArgs.LowerRange
Lower part of progress bar range - always zero
Since:
2013

Autodesk.Revit.DB.Events.ProgressChangedEventArgs.Position
Progress bar position - value is always between zero and upperRange and is incremented by one with each event of stage "PositionChanged"
Since:
2013

Autodesk.Revit.DB.Events.ProgressChangedEventArgs.Stage
The current stage of the progress bar
Since:
2013

Autodesk.Revit.DB.Events.ProgressChangedEventArgs
The event arguments used by the ProgressChanged event.
Since:
2013